examples/openfoam13/vof_to_dpm/example/sprayCrossFlow/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

vertices
(
    ( 0  0  0)
    ( 3  0  0)
    ( 3  1  0)
    ( 0  1  0)
    ( 0  0  1)
    ( 3  0  1)
    ( 3  1  1)
    ( 0  1  1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (90 30 30) simpleGrading (1 1 1)
    //hex (0 1 2 3 4 5 6 7) (120 40 40) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    SYMMETRY
    {
        type symmetry;
        faces
        (
            (0 1 5 4)
            (7 6 2 3)
            (4 5 6 7)
        );
    }
    INLET_AIR
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    WALL
    {
        type wall;
        faces
        (
            (3 2 1 0)
        );
    }
    OUTLET
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
